{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "OpenVLAForActionPrediction",
    "parent_library": "prismatic.extern.hf.modeling_prismatic"
  },
  "base_model_name_or_path": "/root/autodl-tmp/hf_cache/hub/models--openvla--openvla-7b/snapshots/47a0ec7fc4ec123775a391911046cf33cf9ed83f",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": "gaussian",
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_dropout": 0.0,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 32,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "q",
    "v_proj",
    "fc1",
    "o_proj",
    "k_proj",
    "gate_proj",
    "qkv",
    "proj",
    "down_proj",
    "fc2",
    "kv",
    "q_proj",
    "up_proj",
    "lm_head",
    "fc3"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}